{
  "movies": [
    {
      "title": "Braveheart",
      "src": "./assets/braveheart.jpeg",
      "year": "1995",
      "description": "Braveheart is known for its epic battle scenes, portrayal of Scottish history, and themes of freedom  and independence.",
      "id": 1
    },
    {
      "title": "joker",
      "src": "./assets/joker.jpg",
      "year": "2019",
      "description": "Joker film explores the character's origin story, depicting his descent into madness and criminality. ",
      "id": 2
    },
    {
      "title": "Cat Women",
      "src": "./assets/catwomen.webp",
      "year": "2004",
      "description": "Catwoman is a fictional character from DC Comics known for her cat-like agility, stealth, and her complex relationship with Batman.",
      "id": 3
    },
    {
      "title": "shooter",
      "src": "./assets/shooter.jpeg",
      "year": "2007",
      "description": "A marksman living in exile is coaxed back into action after hearing of a plot to kill the President. After being-double crossed for the attempt and on the run, he sets out for the real killer and the truth.",
      "id": 4
    },
    {
      "title": "spiderman",
      "src": "./assets/spiderman.jpg",
      "year": "2002",
      "description": "Spider-Man is a popular superhero character from Marvel Comics,this was the first film in the original Spider-Man trilogy.",
      "id": 5
    },
    {
      "title": "universe",
      "src": "./assets/universe.jpg",
      "year": "2007",
      "description": "This educational show explores many scientific questions and topics about the universe (Big Bang, the Sun, the planets, black holes, other galaxies, astrobiology etc.) through latest CGI, data and interviews with scientists.",
      "id": 6
    },
    {
      "title": "little mermaid",
      "src": "https://books.disney.com/content/uploads/2023/01/1368077226-240-scaled.jpg",
      "description": "A young mermaid makes a deal with a sea witch to trade her beautiful voice for human legs so she can discover the world above water and impress a prince.",
      "year": "2023",
      "id": 7
    }
  ]
}